In [1]:
import pandas as pd

In [2]:
data1 = pd.read_csv('vulcancoin-part1.csv')
data1

              date       tx_from tx_to tx_amount  tx_fee
0       11-15-2018  Central Bank    A1    98 VLC     0.0
1       11-16-2018            A1    B4    35 VLC     4.0
2       11-16-2018  Central Bank    C6    64 VLC     0.0
3       11-16-2018            B4    C6    23 VLC     3.0
4       11-16-2018  Central Bank    B2   167 VLC     0.0
...            ...           ...   ...       ...     ...
567333  06-25-2019  Central Bank    H1   189 VLC     0.0
567334  06-25-2019            F2    G6    15 VLC     1.0
567335  06-25-2019            J6    G5    91 VLC    10.0
567336  06-25-2019            A1    G9    28 VLC     3.0
567337  06-25-2019            K5    H5    67 VLC     7.0

[567338 rows x 5 columns]

In [3]:
data2 = pd.read_csv('vulcancoin-part2.csv')
data2

              date tx_from tx_to tx_amount  tx_fee
0       06-25-2019      F9    K5     7 VLC     1.0
1       06-25-2019      A3    G4   190 VLC     9.0
2       06-25-2019      H6    H9    46 VLC     3.0
3       06-25-2019      A9    D3    17 VLC     2.0
4       06-25-2019      J1    F8   132 VLC    13.0
...            ...     ...   ...       ...     ...
567334  12-09-2019      F5    A6    77 VLC     6.0
567335  12-09-2019      C8    K3    75 VLC     6.0
567336  12-09-2019      K6    C3   148 VLC    17.0
567337  12-09-2019      G4    E3    30 VLC     2.0
567338  12-09-2019      C2    C3    48 VLC     5.0

[567339 rows x 5 columns]

In [7]:
data = pd.concat([data1,data2])
data.reset_index(drop=True)
data

              date       tx_from tx_to tx_amount  tx_fee
0       11-15-2018  Central Bank    A1    98 VLC     0.0
1       11-16-2018            A1    B4    35 VLC     4.0
2       11-16-2018  Central Bank    C6    64 VLC     0.0
3       11-16-2018            B4    C6    23 VLC     3.0
4       11-16-2018  Central Bank    B2   167 VLC     0.0
...            ...           ...   ...       ...     ...
567334  12-09-2019            F5    A6    77 VLC     6.0
567335  12-09-2019            C8    K3    75 VLC     6.0
567336  12-09-2019            K6    C3   148 VLC    17.0
567337  12-09-2019            G4    E3    30 VLC     2.0
567338  12-09-2019            C2    C3    48 VLC     5.0

[1134677 rows x 5 columns]

In [10]:
data1.xs(59999)

date         12-05-2018
tx_from              K8
tx_to                C4
tx_amount        23 VLC
tx_fee                2
Name: 59999, dtype: object

In [13]:
data2.shape

(567339, 5)

In [16]:
data['tx_free']=data['tx_fee'].fillna('3')

In [19]:
data['tx_amount']=data['tx_amount'].apply(lambda x : x.replace(' VLC','')).apply(int)

In [20]:
data.corr()

           tx_amount    tx_fee
tx_amount   1.000000  0.869223
tx_fee      0.869223  1.000000

In [21]:
58653098.60/data['tx_amount'].sum(axis=1)

0.43428936734904844

In [22]:
data['temp'] = data['tx_amount'] - data['tx_fee']

In [23]:
data[
    data['temp'] == data['temp'].max()
]

              date tx_from tx_to  tx_amount  tx_fee tx_free    temp
330175  10-04-2019      K8    F5       1610   128.0     128  1482.0

In [38]:
neg_data = data.groupby('tx_from').agg({'temp':'sum'}).reset_index().rename(columns={'temp':'gaya'})

In [39]:
pos_data = data.groupby('tx_to').agg({'temp':'sum'}).reset_index().rename(columns={'temp':'madya'})

In [40]:
neg_data.merge(
    pos_data,
    left_on='tx_from',
    right_on = 'tx_to',
    how='left'
)\
.assign(diff = lambda x : x['madya']-x['gaya'])\
.max()

tx_from             K9
gaya        1.1323e+07
madya      1.50955e+06
diff            140726
dtype: object

In [42]:
data['month']=data['date'].apply(pd.to_datetime).dt.month

In [43]:
data['month']

0         11
1         11
2         11
3         11
4         11
          ..
567334    12
567335    12
567336    12
567337    12
567338    12
Name: month, Length: 1134677, dtype: int64

In [47]:
temp = 100
prev = -1
for index,row in data.iterrows():
    if row['tx_amount']>200:
        temp = temp-temp*0.01
    if row['month'] != prev:
        temp = temp + 20
    prev = row['month']
print(temp)

8.879775108818699e-21

In [48]:
print(prev)

12

In [49]:
(data['tx_amount'] > 200).sum()

178764

In [50]:
178764

178764

In [ ]:
temp